# SeriousElementReferenceCorruption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..SeriousElementReferenceCorruption Property
BuiltInFailures..::..GeneralFailures Class See Also
---
Element references are seriously corrupt.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SeriousElementReferenceCorruption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SeriousElementReferenceCorruption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SeriousElementReferenceCorruption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace